
/* ******************************************************************** **

@ingroup	神州鹰-硬件部
@author		张天柱
@date		2018/08/08
@brief		MD5 32-bit 加密
@note		使用 OpenSSL 库

@history

@modified	张天柱
@date		2020/02/19
@brief		支持 HK ISAPI MD5 算法

** ****************** 神州鹰 (C) Copyright 2018-2020 ****************** */

#ifndef OPENSSL_MD5_H
#define OPENSSL_MD5_H

/************************************************************************/
/*                                                                      */
/************************************************************************/

#define PASSWDMD5FLAG				"szymd5_"
#define MD5LEN						32

/************************************************************************/
/*                                                                      */
/************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

	void md5_32(const char *in, char *out);

	void hk_isapi_get_md5_hash(unsigned char* buf, int length, unsigned char* digest);

#ifdef __cplusplus
}
#endif

/************************************************************************/
/*                                                                      */
/************************************************************************/

#endif /* OPENSSL_MD5_H */
